Tekla.Structures.Catalogs.MeshItemEnumerator
The MeshItemEnumerator class allows to loop through the catalog mesh items.

Tekla.Structures.Catalogs.MeshItemEnumerator.#ctor
Creates a new instance of the MeshItemEnumerator.

Tekla.Structures.Catalogs.MeshItemEnumerator.System#Collections#IEnumerator#Current
Implementation for the CurrenFt property required by IEnumerator. The returned object
is always of type MeshItem.

Tekla.Structures.Catalogs.MeshItemEnumerator.Current
Returns a mesh item instance of the current element.

Tekla.Structures.Catalogs.MeshItemEnumerator.MoveNext
Moves to the next item in the enumerator.
Returns: False on failure.

Tekla.Structures.Catalogs.MeshItemEnumerator.Reset
Resets the enumerator to the beginning.

Tekla.Structures.Catalogs.MeshItemEnumerator.GetSize
Returns the total amout of items.
Returns: The total amount of items.

Tekla.Structures.Catalogs.MeshItemEnumerator.SelectMeshItem(System.String,System.String)
Selects a mesh item in the mesh database with the given name and grade.
Name: The name of the mesh item to select.
Grade: The grade of the mesh item to select.
Returns: The first MeshItem that matches the conditions.